Public Attributes | List of all members
API_MarkerLinkDataType Struct Reference
Element Manager
This type manifestates as a "linkedMarker" named variable in the detail/worksheet, section and elevation API types, and used to set the referring properties of the marker. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Guid  | referredView
Guid of the referred view. (Only if the marker refers to a view, otherwise this variable does not carry any useful information.)
 API_Guid  | referredDrawing
Guid of the referred drawing. (Only if the marker refers to a drawing, otherwise this variable does not carry any useful information.) You should use the drawingGuid member of one instance of API_DrawingType if you want to create a new element with markerLinkData...
 API_Guid  | referredPMViewPoint
Guid of the referred view point. (Only if the marker refers to a view point, otherwise this variable does not carry any useful information.)
 bool  | sourceMarker
If it's true, the marker is a source marker.
 bool  | customMarker
If it's true, the marker is an unlinked one. The other variables don't represent any meaningful information in this case. If sourceMarker and customMarker are both false, then the marker is a linked one.
 bool  | referToDrawing
This boolean variable has meaning if the marker is a source or linked marker.
 API_ReferringLevel  | referringLevel
This variable carries information if the marker is a source or a linked marker, namely it determindes the referred type. Based on this info it can be decided, that which guid should be used of the three above. The type and the values of this variable are the following: typedef enum { NotReferred = 0, ReferredToViewPoint = 1, ReferredToView = 2, ReferredToDrawing = 3 } API_ReferringLevel.
Detailed Description
This type manifestates as a "linkedMarker" named variable in the detail/worksheet, section and elevation API types, and used to set the referring properties of the marker.